using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class HiraDictionary : MonoBehaviour
{// ひらがなSE取得用分割
    public Dictionary<string, int> dic = new Dictionary<string, int>() {
        {"あ", 0},{"い", 1},{"う", 2},{"え", 3},{"お", 4},
        {"か", 5},{"き", 6},{"く", 7},{"け", 8},{"こ", 9},
        {"さ", 10},{"し", 11},{"す", 12},{"せ", 13},{"そ", 14},
        {"た", 15},{"ち", 16},{"つ", 17},{"て", 18},{"と", 19},
        {"な", 20},{"に", 21},{"ぬ", 22},{"ね", 23},{"の", 24},
        {"は", 25},{"ひ", 26},{"ふ", 27},{"へ", 28},{"ほ", 29},
        {"ま", 30},{"み", 31},{"む", 32},{"め", 33},{"も", 34},
        {"や", 35},{"ゆ", 36},{"よ", 37},
        {"ら", 38},{"り", 39},{"る", 40},{"れ", 41},{"ろ", 42},
        {"わ", 43},{"を", 44},{"ん", 45},
        {"が", 46},{"ぎ", 47},{"ぐ", 48},{"げ", 49},{"ご", 50},
        {"ざ", 51},{"じ", 52},{"ず", 53},{"ぜ", 54},{"ぞ", 55},
        {"だ", 56},{"ぢ", 57},{"づ", 58},{"で", 59},{"ど", 60},
        {"ば", 61},{"び", 62},{"ぶ", 63},{"べ", 64},{"ぼ", 65},
        {"ぱ", 66},{"ぴ", 67},{"ぷ", 68},{"ぺ", 69},{"ぽ", 70},
        
        //イレギュラーな対応
        {"っぷ", 68},{"っく", 7},{"っけ", 8},{"っち", 16},{"っふ", 27},

        //音声差し替え対応あり
        //{"れー", 41},{"ちゃー",77},{"らー", 38},{"ごー", 50},{"ばー", 61},


        {"きゃ",71},{"きゅ",72},{"きょ",73},
        {"しゃ",74},{"しゅ",75},{"しょ",76},
        {"ちゃ",77},{"ちゅ",78},{"ちょ",79},
        {"にゃ",80},{"にゅ",81},{"にょ",82},
        {"ひゃ",83},{"ひゅ",84},{"ひょ",85},
        {"みゃ",86},{"みゅ",87},{"みょ",88},
        {"りゃ",89},{"りゅ",90},{"りょ",91},
        {"ぎゃ",92},{"ぎゅ",93},{"ぎょ",94},
        {"じゃ",95},{"じゅ",96},{"じょ",97},
        {"ぢゃ",98},{"ぢゅ",99},{"ぢょ",100},
        {"びゃ",101},{"びゅ",102},{"びょ",103},
        {"ぴゃ",104},{"ぴゅ",105},{"ぴょ",106},
        {"ヴぁ",107},{"ヴぃ",108},{"ヴ",107},{"ヴぇ",108},{"ヴぉ",109},
        {"らー",107},{"りー",108},{"るー",107},{"れー",108},{"ろー",109},
       
    };

    // TiTypingManager SE取得用分割
    public Dictionary<string, int> dicTi = new Dictionary<string, int>() {
         //小文字
        {"a", 0},{"i", 1},{"u", 2},{"e", 3},{"o", 4},
        {"ka", 5},{"ki", 6},{"ku", 7},{"ke", 8},{"ko", 9},
        {"sa", 10},{"si", 11},{"su", 12},{"se", 13},{"so", 14},
        {"ta", 15},{"ti", 16},{"tu", 17},{"te", 18},{"to", 19},
        {"na", 20},{"ni", 21},{"nu", 22},{"ne", 23},{"no", 24},
        {"ha", 25},{"hi", 26},{"hu", 27},{"he", 28},{"ho", 29},
        {"ma", 30},{"mi", 31},{"mu", 32},{"me", 33},{"mo", 34},
        {"ya", 35},{"yu", 36},{"yo", 37},
        {"ra", 38},{"ri", 39},{"ru", 40},{"re", 41},{"ro", 42},
        {"wa", 43},{"wo", 44},{"n", 45},
        {"ga", 46},{"gi", 47},{"gu", 48},{"ge", 49},{"go", 50},
        {"za", 51},{"zi", 52},{"zu", 53},{"ze", 54},{"zo", 55},
        {"da", 56},{"di", 57},{"du", 58},{"de", 59},{"do", 60},
        {"ba", 61},{"bi", 62},{"bu", 63},{"be", 64},{"bo", 65},
        {"pa", 66},{"pi", 67},{"pu", 68},{"pe", 69},{"po", 70},
        {"shi",11}, {"chi",16},{"tsu",17}, {"fu",27},
        {"ji",52},
        
        //イレギュラーな対応
        {"ppu", 68},{"kku", 7},{"kke", 8},{"tti", 16},{"hhu", 27},
        {"cchi", 16},{"kko", 9},{"Ho", 29},{"kka", 5},
        {"Ti", 16},{"Chi", 16},{"Hu", 27},{"Fu", 27},{"Mi", 31},
        {"To", 19},{"Gu", 48},{"Sa", 10},{"Ka", 5},{"Ni", 21},
        {"Si", 11}, {"Shi", 11},{"Na", 20},{"Gi", 47},{"tto", 19},
        {"Hi", 26},{"Hyō",85},{"Wa", 43},{"Ya", 35},{"Ku", 7},

        //音声差し替え対応あり
        //{"れー", 41},{"ちゃー",77},{"らー", 38},{"ごー", 50},{"ばー", 61},

        {"kya",71},{"kyu",72},{"kyo",73},
        {"sya",74},{"syu",75},{"syo",76},
        {"tya",77},{"tyu",78},{"tyo",79},
        {"nya",80},{"nyu",81},{"nyo",82},
        {"hya",83},{"hyu",84},{"hyo",85},
        {"mya",86},{"myu",87},{"myo",88},
        {"rya",89},{"ryu",90},{"ryo",91},
        {"gya",92},{"gyu",93},{"gyo",94},
        {"zya",95},{"zyu",96},{"zyo",97},
        {"ja",95}, {"ju",96}, {"jo",97}, 
        {"dya",98},{"dyu",99},{"dyo",100},
        {"bya",101},{"byu",102},{"byo",103},
        {"pya",104},{"pyu",105},{"pyo",106},
        {"va",107},{"vi",108},{"vu",109},{"ve",110},{"vo",111},
        
        //ヘボン長音
        {"rā",112},{"rī",113},{"rū",114},{"rē",115},{"rō",116},
        {"bā",125},{"chā",128},{"tyā",128},{"kkō",118},{"gō", 126},
        {"kō", 118},{"sō",119},{"tyū",129}, {"chū",129},{"kyō",127},
        {"Kyō",127},{"tō", 120},{"nō", 121},{"hō", 122},{"Tō", 120},
        {"shū",130}, {"shō",131},{"ō", 117},{"dō", 132},{"chō",79},
        {"hyō",133}, {"Kō", 9},

        //訓令長音
        /*112ー116
        　らー(112)、リー(113)、ルー(114)、レー(115)、ロー(116)
         117ー124
        　おー(117)、こー(118)、そー(119)、とー(120)、のー(121)、ほー(122)、もー(123)、よー(124)
        　125ー12
        　ばー125、ゴー126、キョー127、ちゃー128、ちゅー129、シュー130、ショー131
        */
        {"râ",112},{"rî",113},{"rû",114},{"rê",115},{"rô",116},
        {"bâ",125},{"châ",128},{"tyâ",128},{"kkô",118},{"gô", 126},
        {"kô", 118},{"sô", 119},{"tyû",129}, {"chû",129},{"kyô",127},
        {"Kyô",127},{"tô", 120},{"nô", 121},{"hô", 122},{"Tô", 120},
        {"syû",130}, {"syô",131},{"ô", 117},{"dô", 132},{"tyô",79},
        {"hyô",133},{"Hyô",133}, {"Kô", 9},

        
       
        {"sha",74},{"shu",75}, {"sho",76},{"ssyo",76},
        {"cha",77}, {"chu",78},{"cho",79},{"ssho",76},

         
        //大文字
        {"A", 0},{"I", 1},{"U", 2},{"E", 3},{"O", 4},
        {"KA", 5},{"KI", 6},{"KU", 7},{"KE", 8},{"KO", 9},
        {"SA", 10},{"SI", 11},{"SU", 12},{"SE", 13},{"SO", 14},
        {"TA", 15},{"TI", 16},{"TU", 17},{"TE", 18},{"TO", 19},
        {"NA", 20},{"NI", 21},{"NU", 22},{"NE", 23},{"NO", 24},
        {"HA", 25},{"HI", 26},{"HU", 27},{"HE", 28},{"HO", 29},
        {"MA", 30},{"MI", 31},{"MU", 32},{"ME", 33},{"MO", 34},
        {"YA", 35},{"YU", 36},{"YO", 37},
        {"RA", 38},{"RI", 39},{"RU", 40},{"RE", 41},{"RO", 42},
        {"WA", 43},{"WO", 44},{"N", 45},
        {"GA", 46},{"GI", 47},{"GU", 48},{"GE", 49},{"GO", 50},
        {"ZA", 51},{"ZI", 52},{"ZU", 53},{"ZE", 54},{"ZO", 55},
        {"DA", 56},{"DI", 57},{"DU", 58},{"DE", 59},{"DO", 60},
        {"BA", 61},{"BI", 62},{"BU", 63},{"BE", 64},{"BO", 65},
        {"PA", 66},{"PI", 67},{"PU", 68},{"PE", 69},{"PO", 70},
        {"SHI",11}, {"CHI",16},{"TSU",17}, {"FU",27},
        {"JI",52},
        
        //イレギュラーな対応
        {"PPU", 68},{"KKU", 7},{"KKE", 8},{"TTI", 16},{"HHU", 27},
        {"CCHI", 16},{"SSYO",76},{"SSHO",76},{"KKO", 9},{"KKA", 5},
        {"TTO", 19},

        //音声差し替え対応あり
        //{"れー", 41},{"ちゃー",77},{"らー", 38},{"ごー", 50},{"ばー", 61},


        {"KYA",71},{"KYU",72},{"KYO",73},
        {"SYA",74},{"SYU",75},{"SYO",76},
        {"TYA",77},{"TYU",78},{"TYO",79},
        {"NYA",80},{"NYU",81},{"NYO",82},
        {"HYA",83},{"HYU",84},{"HYO",85},
        {"MYA",86},{"MYU",87},{"MYO",88},
        {"RYA",89},{"RYU",90},{"RYO",91},
        {"GYA",92},{"GYU",93},{"GYO",94},
        {"ZYA",95},{"ZYU",96},{"ZYO",97},
        {"JA",95}, {"JU",96}, {"JO",97}, 
        {"DYA",98},{"DYU",99},{"DYO",100},
        {"BYA",101},{"BYU",102},{"BYO",103},
        {"PYA",104},{"PYU",105},{"PYO",106},
        {"VA",107},{"VI",108},{"VU",107},{"VE",108},{"VO",109},
        //ヘボン長音
        {"RĀ",112},{"RĪ",113},{"RŪ",114},{"RĒ",115},{"RŌ",116},
        {"BĀ",125},{"CHĀ",128},{"TYĀ",128},{"SHŪ",131},{"KKŌ",118},
        {"KŌ",118},{"SŌ", 119},{"GŌ", 126}, {"CHŪ",129},{"TYŪ",129},
        {"KYŌ",127},{"TŌ",120},{"NŌ", 121},{"HŌ", 122},{"Ō",117},{"SHŌ",131},
        {"DŌ", 132},{"CHŌ",79},{"HYŌ",133},
        //訓令長音
        /*112ー116
        　らー(112)、リー(113)、ルー(114)、レー(115)、ロー(116)
         117ー124
        　おー(117)、こー(118)、そー(119)、とー(120)、のー(121)、ほー(122)、もー(123)、よー(124)
        　125ー12
        　ばー125、ゴー126、キョー127、ちゃー128、ちゅー129、シュー130 ショー131
          どー132、ひょー133
        */
         
         //訓令長音
        {"RÂ",112},{"RÎ",113},{"RÛ",114},{"RÊ",115},{"RÔ",116},
        {"BÂ",125},{"CHÂ",128},{"TYÂ",128},{"SYÛ",130},{"KKÔ",118},
        {"KÔ",118},{"SÔ", 119},{"GÔ", 126},{"TYÛ",129},{"TYÔ",79},
        {"KYÔ",127},{"TÔ", 120},{"NÔ",121},{"HÔ", 122},{"SYÔ",131},
        {"Ô",117}, {"DÔ", 132},
       

        {"SHA",74},{"SHU",75}, {"SHO",76},
        {"CHA",77}, {"CHU",78},{"CHO",79},{"HYÔ",133},

       
    };

    // 訓令→ヘボン式へ変換
    public Dictionary<string,string> dicHebon = new Dictionary<string,string>()
    {
        //大文字
        {"SI","SHI"}, {"TI","CHI"},{"TU","TSU"}, {"HU","FU"},
        {"ZI","JI"}, {"ZYA","JA"}, {"ZYU","JU"},{"ZYO","JO"}, 
        {"SYA","SHA"},{"SYU","SHU"}, {"SYO","SHO"},
        {"TYA","CHA"}, {"TYU","CHU"},{"TYO","CHO"},
        {"JYA","JA"},{"JYU","JU"}, {"JYO","JO"},{"TYĀ","CHĀ"},
        
        //単語の出題
        {"GANKYÛ","GANKYŪ"},{"RÂMEN","RĀMEN"},{"KARÊPAN","KARĒPAN"},
        {"HANBÂGÂ","HANBĀGĀ"}, {"YÔGURUTO","YŌGURUTO"},{"TOUNYÛ","TOUNYŪ"},
        {"RENNYÛ","RENNYŪ"},{"HANNBÂGU","HANNBĀGU"},{"TUKUE","TSUKUE"},
        {"MENBÔ","MENBŌ"},{"ROKKÂ","ROKKĀ"},{"GABYÔ","GABYŌ"},{"GAKKÔ","GAKKŌ"},
        {"ZÔKIN","ZŌKIN"},{"BÔSAI","BŌSAI"},{"KÔSATEN","KŌSATEN"},
        {"HIMITU","HIMITSU"}, {"YÛGAO","YŪGAO"},{"RABENDÂ","RABENDĀ"},
        {"TANBO","TAMBO"},{"SIBAHU","SHIBAFU"},{"SUISÔ","SUISŌ"},
        {"TANPOPO","TAMPOPO"},{"HIGANBANA","HIGAMBANA"},{"KANBUN","KAMBUN"},
        {"YUKIMATURI","YUKIMATSURI"},{"SITINARABE","SICHINARABE"},{"NIKKÔYOKU","NIKKŌYOKU"},
        {"OZÔNI","OZŌNI"},{"ÔNAMENTO","ŌNAMENTO"},{"HOKKAIDÔ","HOKKAIDŌ"},
       
        //訓令長音
        {"RÂ","RĀ"},{"RÎ","RĪ"},{"RÛ","RŪ"},{"RÊ","RĒ"},{"RÔ","RŌ"},
        {"BÂ","BĀ"},{"CHÂ","CHĀ"},
        {"TYÂ","CHĀ"},{"SYÛ","SHŪ"},{"KKÔ","KKŌ"},
        {"KÔ","KŌ"},{"SÔ","SŌ"},{"GÔ","GŌ"},{"TYÛ","CHŪ"},{"Ô","Ō"},
        {"KYÔ","KYŌ"},{"TÔ","TŌ"},{"NÔ","NŌ"},{"HÔ","HŌ"},{"SYÔ","SHŌ"},
        {"HYÔ","HYŌ"},

        //イレギュラー
       

        //小文字
        {"si","shi"}, {"ti","chi"},{"tu","tsu"}, {"hu","fu"},
        {"zi","ji"},{"zya","ja"}, {"zyu","ju"}, {"zyo","jo"}, 
        {"sya","sha"},{"syu","shu"}, {"syo","sho"},
        {"tya","cha"}, {"tyu","chu"},{"tyo","cho"},
        {"tyā","chā"}, {"Si","Shi"},{"Hu","Fu"},{"Ti","Chi"},

        //単語の出題
        {"gankyû","gankyū"},

        //訓令長音
        {"râ","rā"},{"rî","rī"},{"rû","rū"},{"rê","rē"},{"rô","rō"},
        {"bâ","bā"},{"châ","chā"},{"tyâ","chā"},
        {"kkô","kkō"},{"gô","gō"},{"ô","ō"},
        {"kô","kō"},{"sô","sō"},{"tyû","chū"}, {"chû","chū"},{"kyô","kyō"},
        {"Kyô","Kyō"},{"tô","tō"},{"nô","nō"},{"hô","hō"},
        {"syû","shū"},{"syô","shō"},{"hyô","hyō"},

    };
    //大文字
    public Dictionary<string, string> dicT = new Dictionary<string, string>() {
        {"A", "A"},{"I","I"},{"U", "U"},{"E", "E"},{"O", "O"},
        {"KA", "KA"},{"KI", "KI"},{"KU", "KU"},{"KE", "KE"},{"KO", "KO"},
        {"SA", "SA"},{"SI", "SHI"},{"SU", "SU"},{"SE", "SE"},{"SO", "SO"},
        {"TA", "TA"},{"TI", "CHI"},{"TU", "TSU"},{"TE", "TE"},{"TO", "TO"},
        {"NA", "NA"},{"NI", "NI"},{"NU", "NU"},{"NE", "NE"},{"NO", "NO"},
        {"HA", "HA"},{"HI", "HI"},{"HU", "FU"},{"HE", "HE"},{"HO", "HO"},
        {"MA", "MA"},{"MI", "MI"},{"MU", "MU"},{"ME", "ME"},{"MO", "MO"},
        {"YA", "YA"},{"YU", "YU"},{"YO", "YO"},
        {"RA", "RA"},{"RI", "RI"},{"RU", "RU"},{"RE", "RE"},{"RO", "RO"},
        {"WA", "WA"},{"WO", "WO"},{"N", "N"},
        {"GA", "GA"},{"GI", "GI"},{"GU", "GU"},{"GE", "GE"},{"GO", "GO"},
        {"ZA", "ZA"},{"ZI", "JI"},{"ZU", "ZU"},{"ZE", "ZE"},{"ZO", "ZO"},
        {"DA", "DA"},{"DI", "DI"},{"DU", "DU"},{"DE", "DE"},{"DO", "DO"},
        {"BA", "BA"},{"BI", "BI"},{"BU", "BU"},{"BE", "BE"},{"BO", "BO"},
        {"PA", "PA"},{"PI", "PI"},{"PU", "PU"},{"PE", "PE"},{"PO", "PO"},
        
        {"KYA","KYA"},{"KYU","KYU"},{"KYO","KYO"},
        {"SYA","SHA"},{"SYU","SHU"},{"SYO","SHO"},
        {"TYA","CHA"},{"TYU","CHU"},{"TYO","CHO"},
        {"NYA","NYA"},{"NYU","NYU"},{"NYO","NYO"},
        {"HYA","HYA"},{"HYU","HYU"},{"HYO","HYO"},
        {"MYA","MYA"},{"MYU","MYU"},{"MYO","MYO"},
        {"RYA","RYA"},{"RYU","RYU"},{"RYO","RYU"},
        {"GYA","GYA"},{"GYU","GYU"},{"GYO","GYO"},
        {"ZYA","JA"},{"ZYU","JU"},{"ZYO","JO"},
        {"DYA","DYA"},{"DYU","DYU"},{"DYO","DYO"},
        {"BYA","BYA"},{"BYU","BYU"},{"BYO","BYO"},
        {"PYA","PYA"},{"PYU","PYU"},{"PYO","PYO"},
        {"VA","VA"},{"VI","VI"},{"VU","VU"},{"VE","VE"},{"VO","VO"},

    };
    //小文字
    public Dictionary<string, string> dicS = new Dictionary<string, string>() {

        {"あ", "a"},{"い", "i"},{"う", "u"},{"え", "e"},{"お", "o"},
        {"か", "ka"},{"き", "ki"},{"く", "ku"},{"け", "ke"},{"こ", "ko"},
        {"さ", "sa"},{"し", "si"},{"す", "su"},{"せ", "se"},{"そ", "so"},
        {"た", "ta"},{"ち", "ti"},{"つ", "tu"},{"て", "te"},{"と", "to"},
        {"な", "na"},{"に", "ni"},{"ぬ", "nu"},{"ね", "ne"},{"の", "no"},
        {"は", "ha"},{"ひ", "hi"},{"ふ", "hu"},{"へ", "he"},{"ほ", "ho"},
        {"ま", "ma"},{"み", "mi"},{"む", "mu"},{"め", "me"},{"も", "mo"},
        {"や", "ya"},{"ゆ", "yu"},{"よ", "yo"},
        {"ら", "ra"},{"り", "ri"},{"る", "ru"},{"れ", "re"},{"ろ", "ro"},
        {"わ", "wa"},{"を", "wo"},{"ん", "n"},
        {"が", "ga"},{"ぎ", "gi"},{"ぐ", "gu"},{"げ", "ge"},{"ご", "go"},
        {"ざ", "za"},{"じ", "zi"},{"ず", "zu"},{"ぜ", "ze"},{"ぞ", "zo"},
        {"だ", "da"},{"ぢ", "di"},{"づ", "du"},{"で", "de"},{"ど", "do"},
        {"ば", "ba"},{"び", "bi"},{"ぶ", "bu"},{"べ", "be"},{"ぼ", "bo"},
        {"ぱ", "pa"},{"ぴ", "pi"},{"ぷ", "pu"},{"ぺ", "pe"},{"ぽ", "po"},
        
        {"きゃ","kya"},{"きゅ","kyu"},{"きょ","kyo"},
        {"しゃ","sya"},{"しゅ","syu"},{"しょ","syo"},
        {"ちゃ","tya"},{"ちゅ","tyu"},{"ちょ","tyo"},
        {"にゃ","nya"},{"にゅ","nyu"},{"にょ","nyo"},
        {"ひゃ","hya"},{"ひゅ","hyu"},{"ひょ","hyo"},
        {"みゃ","mya"},{"みゅ","myu"},{"みょ","myo"},
        {"りゃ","rya"},{"りゅ","ryu"},{"りょ","ryo"},
        {"ぎゃ","gya"},{"ぎゅ","gyu"},{"ぎょ","gyo"},
        {"じゃ","zya"},{"じゅ","zyu"},{"じょ","zyo"},
        {"ぢゃ","dya"},{"ぢゅ","dyu"},{"ぢょ","dyo"},
        {"びゃ","bya"},{"びゅ","byu"},{"びょ","byo"},
       
        {"ぴゃ","pya"},{"ぴゅ","pyu"},{"ぴょ","pyo"},
        {"ヴぁ","va"},{"ヴぃ","vi"},{"ヴ","vu"},{"ヴぇ","ve"},{"ヴぉ","vo"},
       
        {"、","," },{"。","."},{"「","["},{"」","]"},
    };

    // デフォルトではない入力方法
    public Dictionary<string, List<string>> dicSEx = new Dictionary<string, List<string>>()
    {
        {"か", new List<string>{"ca"}},{"し", new List<string>{"ci","shi"}},{"く", new List<string>{"cu","qu"}},
        {"せ", new List<string>{"ce"}},{"こ", new List<string>{"co"}},{"ちゃ", new List<string>{"cha","cya"}},
        {"ち", new List<string>{"chi","cyi"}},{"ちゅ", new List<string>{"chu","cyu"}},
        {"ちぇ", new List<string>{"che","cye"}},{"ちょ", new List<string>{"cho","cyo"}},
        {"ふ", new List<string>{"fu"}},{"じゃ", new List<string>{"ja"}},{"じ", new List<string>{"ji"}},
        {"じゅ", new List<string>{"ju"}},{"じぇ", new List<string>{"je"}},{"じょ", new List<string>{"jo"}},
        {"ぁ", new List<string>{"la","xa"}},{"ぃ", new List<string>{"li","xi"}},{"ぅ", new List<string>{"lu","xu"}},
        {"ぇ", new List<string>{"le","xe"}},{"ぉ", new List<string>{"lo","xo"}},{"ゃ", new List<string>{"lya","xya"}},
        {"ゅ", new List<string>{"lyu","xyu"}},{"ょ", new List<string>{"lyo","xyo"}},
        {"っ", new List<string>{"ltu","xtu"}},{"ん", new List<string>{"nn"}},{"くぃ", new List<string>{"qyi"}},
        {"くぇ", new List<string>{"qye"}},{"しゃ", new List<string>{"sha"}},{"しゅ", new List<string>{"shu"}},
        {"しぇ", new List<string>{"she"}},{"しょ", new List<string>{"sho"}},{"つ", new List<string>{"tsu"}},
    };
}

